In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.2.3'

In [6]:

emp = pd.read_excel(r"C:\Users\mayur\Downloads\Rawdata (1).xlsx")

In [7]:
visa_df

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

Data cleaning

In [22]:
emp['Name']

0      Mike
1    Teddy^
2     Uma#r
3      Jane
4    Uttam*
5       Kim
Name: Name, dtype: object

In [24]:
emp['Name'] = emp['Name'].str.replace(r'\w,', '', regex=True)

In [25]:
emp['Name']

0      Mike
1    Teddy^
2     Uma#r
3      Jane
4    Uttam*
5       Kim
Name: Name, dtype: object

In [26]:
emp.columns

Index(['Name', 'Domain', 'Age', 'Location', 'Salary', 'Exp'], dtype='object')

In [27]:
emp.head(1)

   Name         Domain       Age Location  Salary Exp
0  Mike  Datascience#$  34 years   Mumbai  5^00#0  2+

In [28]:
emp['Domain']

0     Datascience#$
1           Testing
2    Dataanalyst^^#
3       Ana^^lytics
4        Statistics
5               NLP
Name: Domain, dtype: object

In [29]:
emp['Domain'] = emp['Domain'].str.replace(r'\W','',regex=True)

In [30]:
emp

     Name       Domain       Age   Location   Salary      Exp
0    Mike  Datascience  34 years     Mumbai   5^00#0       2+
1  Teddy^      Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst       NaN        NaN  1$5%000   4> yrs
3    Jane    Analytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*   Statistics     67-yr        NaN   30000-  5+ year
5     Kim          NLP      55yr      Delhi  6000^$0      10+

In [31]:
emp['Location'] = emp['Location'].str.replace(r'\W','',regex=True)

In [32]:
emp

     Name       Domain       Age   Location   Salary      Exp
0    Mike  Datascience  34 years     Mumbai   5^00#0       2+
1  Teddy^      Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst       NaN        NaN  1$5%000   4> yrs
3    Jane    Analytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*   Statistics     67-yr        NaN   30000-  5+ year
5     Kim          NLP      55yr      Delhi  6000^$0      10+

In [33]:
emp['Age'] = emp['Age'].str.replace(r'\W','',regex=True)

In [35]:
emp['Age']

0    34years
1       45yr
2        NaN
3        NaN
4       67yr
5       55yr
Name: Age, dtype: object

In [36]:
emp['Age'] = emp['Age'].str.extract('(\\d+)') # r(r'(\\d+)')

In [37]:
emp['Age']

0     34
1     45
2    NaN
3    NaN
4     67
5     55
Name: Age, dtype: object

In [38]:
emp

     Name       Domain  Age   Location   Salary      Exp
0    Mike  Datascience   34     Mumbai   5^00#0       2+
1  Teddy^      Testing   45  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst  NaN        NaN  1$5%000   4> yrs
3    Jane    Analytics  NaN   Hyderbad   2000^0      NaN
4  Uttam*   Statistics   67        NaN   30000-  5+ year
5     Kim          NLP   55      Delhi  6000^$0      10+

In [39]:
emp['Salary'] = emp['Salary'].str.replace(r'\W','',regex=True)

In [40]:
emp['Salary']

0     5000
1    10000
2    15000
3    20000
4    30000
5    60000
Name: Salary, dtype: object

In [41]:
emp

     Name       Domain  Age   Location Salary      Exp
0    Mike  Datascience   34     Mumbai   5000       2+
1  Teddy^      Testing   45  Bangalore  10000       <3
2   Uma#r  Dataanalyst  NaN        NaN  15000   4> yrs
3    Jane    Analytics  NaN   Hyderbad  20000      NaN
4  Uttam*   Statistics   67        NaN  30000  5+ year
5     Kim          NLP   55      Delhi  60000      10+

In [42]:
emp['Exp'] = emp['Exp'].str.extract('(\\d+)')

In [43]:
emp

     Name       Domain  Age   Location Salary  Exp
0    Mike  Datascience   34     Mumbai   5000    2
1  Teddy^      Testing   45  Bangalore  10000    3
2   Uma#r  Dataanalyst  NaN        NaN  15000    4
3    Jane    Analytics  NaN   Hyderbad  20000  NaN
4  Uttam*   Statistics   67        NaN  30000    5
5     Kim          NLP   55      Delhi  60000   10

In [44]:
clean_data = emp.copy()